<?php

// ******** EDIT THESE ********** //

$lang['lang'] = "uk"; // Name of this pack
$lang['name'] = "Українська мова"; // Name of this pack
$lang['ENCODING'] = "windows-1251"; // Encoding


// ******** DONOT TOUCH THIS !! ********** //
if (isset($load_lang_pack) && $load_lang_pack == true) {
    return;
}


// ******** START TRANSLATION HERE ********** //

// Short terms ссилка - посилання
$lang['total'] = "Всього";
$lang['prev'] = "попередня";
$lang['next'] = "наступна";
$lang['or'] = "Або";
$lang['change'] = "Змінити";
$lang['all'] = "Усіх";
$lang['anywere'] = "Усюди";
$lang['any'] = "Будь-яка";
$lang['any1'] = "Будь-який";
$lang['new'] = "Новий";
$lang['edit'] = " Редагувати ";
$lang['delete'] = "Видалити";
$lang['del'] = "Знищити";
//$lang['clear']="Очистити";
$lang['mod'] = "Змінити";
$lang['save'] = " Зберегти  ";
$lang['home'] = "Домашня сторінка";
$lang['update'] = "Зберегти";
$lang['close'] = "Закрити";
$lang['back'] = "Назад";

$lang['posts'] = "Публикацій";
$lang['blog'] = "Сторінка";
$lang['blogs'] = "Сторінки";
$lang['title'] = "Заголовок";
$lang['summary'] = "Коротко";
$lang['body'] = "Тіло публікації";
$lang['author'] = "Автор";
$lang['the_date'] = "Дата";
$lang['calendar'] = "Календар";
$lang['rating'] = "Рейтинг";
$lang['rate'] = "Рейтинг";
$lang['votes'] = "Голоси";
$lang['access'] = "Доступ";
$lang['blog_roll'] = "Сторінки:";
$lang['send'] = "Надіслати";
$lang['comments'] = "Коментарі";
$lang['unavaible'] = "- недоступний :(";


$lang['archive'] = "Архів";
$lang['search'] = "Пошук";
$lang['show'] = "Показати";
$lang['adv_search'] = "Розширений пошук";
//$lang['search_this']="Пошук по цьому сайту";
$lang['recent_posts'] = "Останні публікації";
$lang['list_posts'] = "Список публікацій";
$lang['new_but'] = "-- нова --";

$lang['normal'] = "Нормальний";
$lang['hidden'] = "Прихований";
$lang['open'] = "Відкритий";
$lang['draft'] = "Чорновик";

// Common strings
$lang['str_by'] = "Опубліковано"; //comments
$lang['str_on'] = " "; //date
$lang['str_all'] = "Все";
$lang['posted_by'] = "Опубліковано";
$lang['edited_by'] = "Відредаговано";
$lang['str_more'] = "детальніше";


$lang['send_post'] = "Вислати на email";
$lang['send_post_title'] = "Вислати другу електронною поштою";
$lang['post_comment'] = "Написати коментар";
$lang['view_comments'] = "Переглянути коментарі";
$lang['print'] = "Версія для друку";
$lang['rate_this'] = "Оцінити";

// Printer friendly page

$lang['print_from'] = "Публікація з";
$lang['printed_from'] = "Надруковано з";


$lang['powered'] = "Розробка сайту";

// =======================
// New post page

$lang['post_title'] = "Заголовок";
$lang['post_keys'] = "Ключові слова для пошукових машин";
$lang['post_format'] = "Формат вводу";

$lang['post_attach'] = "Прикріплені файли";
$lang['post_attach_clear'] = "Очистити прикріплені файли";
$lang['post_attach_mg'] = "Змінити прикріплені файли";

$lang['post_note'] = "заповнювати поле \"Розгорнуто\" необовязково";
$lang['post_smr'] = "Коротко";
$lang['post_content'] = "Розгорнуто";
$lang['post_icon'] = "Іконка публікації";
$lang['post_icon_resize'] = "Зменшити до розміру";
$lang['cancel'] = "Відміна"; // (3.1)

$lang['post_normal'] = "Нормальна публікація";
$lang['post_date'] = "Дата опублікування (У форматі день/місяць/рік год:хв)<br/><small>Залиште поле порожнім і автоматично буде записана поточна дата<br/></small>";

$lang['post_draft'] = "Відкладена (публікується у заданий день)";
$lang['post_hidden'] = "Прихована";
$lang['do_email'] = "Розіслати всім електронною поштою";
$lang['do_details'] = "Відображати деталі(дату, автора і т.п.)";


$lang['post_attached'] = "Прикріплені файли";
$lang['post_smile'] = "Опис смайликів";
$lang['post_post_but'] = " Опублікувати ";
$lang['post_post_preview'] = " Попередній перегляд ";
$lang['post_nest_2'] = "Не забудьте зберегти батьківську публікацію";
$lang['post_nest_1'] = "Публікація успішно додана.";
$lang['post_nest_3'] = " (оцю, що перед Вами)";

$lang['post_edit'] = "Редагувати: \"%title%\"";
$lang['post_rss_no'] = "The post was successfully added, however the rss/xml feed generator failed. Please check the permission of the /rss directory";
$lang['del_post_confirm'] = "Ви впевнені що хочете знищити відмічені публікації?";
// =======================

// Send to friend form

$lang['snd_name'] = "Ваше ім'я";
$lang['snd_email'] = "Ваш email";

$lang['snd_title'] = "Відправити публікацію \"%title%\" другу";
// Donot remove the %title% . The article's title appears there

$lang['snd_email_req'] = "Введіть хоча б одну адресу!";
$lang['snd_em1'] = "Email #1";
$lang['snd_em2'] = "Email #2";
$lang['snd_em3'] = "Email #3";
$lang['snd_em4'] = "Email #4";
$lang['snd_em5'] = "Email #5";
$lang['snd_comments'] = "Ваш коментар (необов'язково)";
$lang['snd_but'] = " Відправити ";

$lang['snd_no'] = "Відправка пошти відключена!";
$lang['snd_inv_email_to_msg'] = "Ви ввели неправильну адресу в полі 'Кому'!";

$lang['snd_success'] = "Публікація \"%article%\" була успішно відправлена наступним адресатам:";


// =======================
// USERS

// Registration and user info

$lang['users'] = "Користувачі"; //"Користувач"
$lang['user_box_txt'] = "Увійти";
$lang['user_box_acc'] = "Моя сторінка";
$lang['user_login'] = "Логін";
$lang['user_important'] = "\\n Ви впевнені що хочете змінити ";
$lang['user_name'] = "Повне ім'я";
$lang['user_email'] = "Email";
$lang['user_card'] = "Номер картки";
$lang['user_no_card'] = "Клубної картки";
$lang['user_no_c1'] = "не має";
$lang['user_tel'] = "Номер телефону";
$lang['user_url'] = "Сторінка в інтернеті";
$lang['user_pass0'] = "Старий пароль";
$lang['user_pass1'] = "Новий пароль";
$lang['user_pass'] = "Пароль";
$lang['user_pass2'] = "Повторіть пароль";
$lang['user_hobby'] = "Спеціальність";
$lang['user_location'] = "Адреса";
$lang['user_study'] = "Місце навчання";
$lang['user_birth'] = "Дата народження";
$lang['user_icq'] = "ICQ";
$lang['user_profile'] = "Особисті дані";
$lang['user_me'] = "Про мене";
$lang['user_vp'] = "Переглянути фотографію";
$lang['user_cp'] = "Очистити фото";

$lang['user_total_posts'] = "Всього публікацій";
$lang['user_total_cmts'] = "Всього коментарів";
$lang['user_l_login'] = "Останній вхід";

$lang['u'][0] = '&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;---&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;';
$lang['u'][1] = 'немає';
$lang['u'][2] = '1 курс';
$lang['u'][3] = '2 курс';
$lang['u'][4] = '3 курс';
$lang['u'][5] = '4 курс';
$lang['u'][6] = '5 курс';
$lang['u'][7] = '6 курс';
$lang['u'][8] = 'закінчена';
$lang['u_max'] = 8;
$lang['u_info'] = 'Вища освіта';


$lang['user_reg_title'] = "Реєстрація нового користувача";
$lang['user_in'] = "Форма логування";
$lang['user_signup'] = "Зареєструватися";

$lang['user_reg_info'] = "Номер картки";
$lang['user_reg'] = "Чи є у Вас клубна картка?";
$lang['user_reg_1'] = "У мене є картка";
$lang['user_reg_2'] = "У мене немає картки";
$lang['user_reg_link'] = "Щоб ознайомитись з умовами придбання картки, натисніть сюди";


$lang['user_blogs'] = "Сторінки, які користувач може редагувати";
$lang['user_blogs1'] = "Сторінки, які Ви можете редагувати";
$lang['user_short_login'] = "Логін повинен бути довжиною від 3 до 10 символів";
$lang['user_short_pass'] = "Пароль занадто короткий! Мінімум 5 символів";
$lang['user_card_no'] = "Номер картки це п'ять чи більше цифр!";
$lang['no_card_no'] = "Власник картки повинен мати номер картки!";
$lang['card_no'] = "Неіснуюча картка!";
$lang['user_pass_nomatch'] = "Паролі не співпадають!";
$lang['user_pic'] = "Ваша фотографія";
$lang['user_get_email'] = "Отримувати новини клубу поштою";
$lang['user_pic_show'] = "Показувати мене в \"користувачі на сайті\"";
$lang['pic_size_fail'] = "Максимальний розмір файлу %size% KB!";
$lang['exists'] = " не унікальний";
$lang['user_exists_msg'] = "Користувач з такими даними уже зареєстрований! ";
$lang['user_blog_no_sel'] = "Виберіть сторінку!";

$lang['reg_s_title'] = "Реєстрація успішна!";
$lang['reg_s_msg'] = "Дякуємо! Ваша персональна інформація вислана Вам на електонну пошту";

$lang['user_welcome_subject'] = "Дякуємо за реєстрацію!"; // New user welcome email subject
$lang['user_notify_subject'] = "Повідомлення: Реєстрація нового користувача";
$lang['user_forgot_subject'] = "Відновленя паролю"; // Subject of the forgot password mail

$lang['user_no_accept'] = "Вибачте, на даний момент реєстрація нових корнистувачів відключена. Спробуйте зайти  через кілька днів.";


$lang['user_joined'] = "Приєднався до нас";
$lang['user_disp_id'] = "Відображати ";
$lang['user_disp_email'] = "Еmail видимий для всіх";
$lang['user_disp_profile'] = "Не показувати нікому Ваших даних";

// Login
$lang['logged'] = "Ви залоговані як";
$lang['user_login_title'] = "Логін";
$lang['user_logout'] = "Вийти";
$lang['user_login_but'] = "Увійти";
$lang['last_login'] = "Останній вхід";
$lang['user_login_remember'] = "Памятати&nbsp;мене";
$lang['user_login_false'] = "Неправильний логін або пароль.<br/> Перевірте розкладку клавіатури";
$lang['user_cap_empty'] = "Потрібно ввести код підтвердження!";
$lang['user_cap_false'] = "Ви ввели неправильний код";
$lang['user_cap'] = "Введіть код, який зображено на малюнку";
$lang['forgot'] = "Пароль буде вислано на Вашу поштову скриньку";
$lang['user_forgot_pass'] = "Відновити&nbsp;пароль";
$lang['user_forgot_but'] = "Отримати мій пароль";
$lang['user_forgot_false'] = "Не знайдено користувача з такою поштовою адресою";
$lang['user_frozen'] = "Вас відключив адміністратор!";
$lang['user_forgot_send_msg'] = "Вам присвоєно новий пароль і відіслано на Вашу скриньку!";

// Panel
$lang['user_mbr_title'] = "Сторінка користувача";
$lang['user_welcome'] = "Ласкаво просимо!";


$lang['user_level_info'] = "Ваш рівень";
$lang['user_level'][-1] = "Усі";
$lang['user_level'][0] = "Відключений";
$lang['user_level'][1] = "Зареєстрований користувач";
$lang['user_level'][2] = "Власник картки";
$lang['user_level'][3] = "Модератор";
$lang['user_level'][4] = "Адміністратор";

$lang['level_info'] = "Ваші можливості";
$lang['level_0'] = "нема";
$lang['level_1'] = "Отримування новин поштою";
$lang['level_2'] = "Перегляд закритих сторінок";
$lang['level_3'] = "Редагування сторінок";
$lang['level_4'] = "Контроль за користувачами";

$lang['user_post_new'] = "Нова публікація";
$lang['user_post_edit'] = "Редагувати публікацї";
$lang['user_post_list'] = "Список публікацій";
$lang['user_acc'] = "Мої особисті дані";


$lang['user_new_title'] = "Написати нову публікацію";
$lang['user_pass_need'] = "Змінити пароль";


// File manager
$lang['file_title'] = "Завантажити файли";
$lang['file_fl'] = " Файл ";
$lang['file_but'] = " Завантажити ";


// =======================
// Date / Calendar (3.1)

$lang['caln_tip'] = "Опубліковано";
$lang['caln_next'] = "Наступний місяць";
$lang['caln_prev'] = "Попередній місяць";


$lang['c'][0] = 'усі';
$lang['c'][1] = 'лише зареєстровані користувачі';
$lang['c'][2] = 'лише власники картки';
$lang['c'][3] = 'лише модератори';
$lang['c']['info'] = 'Інформацію можуть бачити %x%';
$lang['c']['info1'] = 'Цю публікацію можуть бачити ';
$lang['c']['info2'] = "Реєстрація на сайті та придбання карти дає змогу бачити приховану інформацію";


// Full Weekdays
$lang['date']['Sunday'] = 'Неділя';
$lang['date']['Monday'] = 'Понеділок';
$lang['date']['Tuesday'] = 'Вівторок';
$lang['date']['Wednesday'] = 'Середа';
$lang['date']['Thursday'] = 'Четвер';
$lang['date']['Friday'] = 'Пятниця';
$lang['date']['Saturday'] = 'Субота';

// Weekdays Abbrivated
$lang['date']['Sun'] = 'Нед';
$lang['date']['Mon'] = 'Пон';
$lang['date']['Tue'] = 'Вів';
$lang['date']['Wed'] = 'Срд';
$lang['date']['Thu'] = 'Чтв';
$lang['date']['Fri'] = 'Пят';
$lang['date']['Sat'] = 'Суб';

// Weekdays even shorter :)
$lang['date']['week_day_1'] = 'Н';
$lang['date']['week_day_2'] = 'П';
$lang['date']['week_day_3'] = 'В';
$lang['date']['week_day_4'] = 'С';
$lang['date']['week_day_5'] = 'Ч';
$lang['date']['week_day_6'] = 'П';
$lang['date']['week_day_7'] = 'С';

// Months
$lang['d1']['January'] = 'Січень';
$lang['d1']['February'] = 'Лютий';
$lang['d1']['March'] = 'Березень';
$lang['d1']['April'] = 'Квітень';
$lang['d1']['May'] = 'Травень';
$lang['d1']['June'] = 'Червень';
$lang['d1']['July'] = 'Липень';
$lang['d1']['August'] = 'Серпень';
$lang['d1']['September'] = 'Вересень';
$lang['d1']['October'] = 'Жовтень';
$lang['d1']['November'] = 'Листопад';
$lang['d1']['December'] = 'Грудень';

$lang['date']['January'] = 'Січня';
$lang['date']['February'] = 'Лютого';
$lang['date']['March'] = 'Березня';
$lang['date']['April'] = 'Квітня';
$lang['date']['May'] = 'Травня';
$lang['date']['June'] = 'Червня';
$lang['date']['July'] = 'Липня';
$lang['date']['August'] = 'Серпня';
$lang['date']['September'] = 'Вересня';
$lang['date']['October'] = 'Жовтня';
$lang['date']['November'] = 'Листопада';
$lang['date']['December'] = 'Грудня';

// Months abbrivated
$lang['date']['Jan'] = 'Січ';
$lang['date']['Feb'] = 'Лют';
$lang['date']['Mar'] = 'Бер';
$lang['date']['Apr'] = 'Кві';
//$lang['date']['May'] = 'Тра';
$lang['date']['Jun'] = 'Чер';
$lang['date']['Jul'] = 'Лип';
$lang['date']['Aug'] = 'Сер';
$lang['date']['Sep'] = 'Вер';
$lang['date']['Oct'] = 'Жов';
$lang['date']['Nov'] = 'Лис';
$lang['date']['Dec'] = 'Гру';

//serious bud with may
// =======================
// Search

$lang['rel'] = "Релевантність";
$lang['search_in'] = "Пошук по";
$lang['search_all'] = "Усьому";
$lang['search_title'] = "Заголовку";
$lang['search_content'] = "Тексту";
$lang['search_author'] = "Імені автора";
$lang['search_reslut_msg'] = "Результати пошуку для %key%";
$lang['search_resut_no'] = "За цим запитом нічого не знайдено";
$lang['search_key'] = "Занадто коротке слово! Мінімум три символа!";
$lang['search_count'] = "%num% результатів";
$lang['pages_show'] = "На сторінках&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";


// =======================
//By time description
$lang['admin_post_show'] = "Дата останньої зміни";
$lang['admin_post_week'] = "Цього тижня";
$lang['admin_post_month'] = "Цього місяця";
$lang['admin_post_last_month'] = "Місяць тому";
$lang['admin_post_last_6month'] = "2-12 місяців тому";
$lang['admin_post_last_year'] = "Більше року тому";
$lang['admin_del_chk'] = "Інвертувати виділення";

//no_discount
$lang['no_discount'] = "Мені не дали знижку";
$lang['no_discount_0'] = "Хто не дав знижку?";
$lang['no_discount_tip'] = "Не дали знижку?<br/> Напиши про це нам!";
$lang['no_discount_1'] = "Організація";
$lang['no_discount_2'] = "Менеджер або касир";
$lang['no_discount_3'] = "Причина відмови";
$lang['no_discount_4'] = "Ваші контакти";
$lang['no_discount_4a'] = "Ваш номер картки";
$lang['no_discount_5'] = "Ваша скарга успішно надіслана";


// =======================
// General Error messages

$lang['error_cookie'] = "Сookies повинні бути увімкнені! Можливо, хтось ще залогувався під вашим іменем";
$lang['error_no_title1'] = "Ви не ввели заголовок ";
$lang['error_no_numeric'] = "Потрібно ввести число ";
//$lang['error_no_src1']="Ви не заповнили поле короткої новини!";
$lang['empty_fields'] = "Ви не заповнили усі поля. Перевірте ще раз";
$lang['incorrect_email'] = "Ви ввели неправильну e-mail адресу";
$lang['denied'] = "Доступ заборонено!";
$lang['err_write'] = "Папка закрита для запису";
$lang['no_file'] = "Не можу прочитати файл";
$lang['no_img'] = "Не можу завантажити зображення";
$lang['closed_blog'] = "Ця сторінка закрита для перегляду";
$lang['post_no_access'] = "У Вас немає доступу до цієї публікації";
$lang['post_no_mod'] = "Ви не маєте прав для редагування цієї публікації";
//$lang['post_no_area']="У Вас немає доступу до користувацького меню";

$lang['no_id'] = "Не знайдено такої публікації";
$lang['no_user'] = "Не знайдено такого користувача";
$lang['no_archive'] = "Не знайдено публікацій за цей місяць: %date%";
$lang['no_blog'] = "Задана сторінка не знайдена";
$lang['no_data_avail'] = " Нічого не знайдено =( ";
$lang['no_cat'] = "Немає такої підкатегорії";
$lang['banned'] = "Вас відключив адміністратор";
$lang['profiles_no_pub'] = "Користувач не захотів публікувати свої дані";
$lang['blog_frozen'] = "Ця сторінка тільки для власників картки";
//$lang['user_frozen']="Цей користувач закритий адміністратором";
$lang['rss_no_blog'] = "Cannot generate RSS feed! The page you requested doesn't exist!";


//Subcats
$lang['subcats'] = "Підкатегорії";
$lang['subcat'] = "Підкатегоря";
$lang['subcat_change'] = "Змінити підкатегорію";
$lang['subcat_change_confirm'] = "Ви дійсно бажаєте змінити підкатегорію?\\n(разом з нею може бути змінена сторінка)";
$lang['subcat_del_post'] = "Разом з публікаціями";
$lang['subcat_del_confirm'] = "Ви справді хочете видалити підкатегорію?";
$lang['subcat_empty'] = "Виберіть підкатегорію зі списку?";
$lang['subcat_post_del_confirm'] = "Ви хочете видалити публікації з підкатегорії?";
$lang['subcat_selected'] = "Виділіть підкатегорї, які будуть відображатися на цій сторінці";


// ADMIN

//if(! IN_ADMIN) break;
$lang['admin'] = "Адміністратор";
$lang['neither'] = " --- нема --- ";
/////////////////////////////////////////////////////////////////////////
// =======================


$lang['admin_del_sel_but'] = "ЗН�?Щ�?Т�? В�?ДІЛЕНІ";
$lang['admin_sel_h'] = "Виділити приховані";
$lang['admin_sel_d'] = "Виділити чорновики";
$lang['admin_sel_s'] = "Виділити мої публікації";
// General2


$lang['sort'] = "Сортувати";
$lang['stat'] = "Статистика - new";
$lang['stat_click'] = " Всього кліків на публікацію";


$lang['ppage'] = "Відображати";
$lang['level'] = "Рівень";
$lang['users_online'] = "Користувачі на сайті"; // (3.1)
$lang['geo_ip'] = "Подивитися, де розташований користувач на карті";
$lang['save_js'] = "Це вікно повинно закритися автоматично при включеному JavaScript. Якщо ні, закрийте його самостійно будьласка."
?>
